publish/11.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Weekly#11</title>
<meta name="author" content="Spike Leung" />
<meta name="description" content="&quot;&quot;" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="stylesheet" href="https://chinese-fonts-cdn.deno.dev/packages/lxgwwenkai/dist/LXGWWenKai-Regular/result.css" />
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/index.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung/taxodium/tree/org-publish">GitHub</a></li>
    <li><a href="https://music.163.com/#/playlist?id=12531191848">Playlist</a></li>
    <li><a href="/_blank.html">_blank</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Weekly#11</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgef57690">News | Article</a></li>
<li><a href="#org23ecab4">Tutorial</a></li>
<li><a href="#org0016c43">Code</a></li>
<li><a href="#org1be84ce">Cool Bit</a></li>
<li><a href="#orgcff35e3">Tool | Library</a></li>
<li><a href="#orgb89c528">推荐博客</a></li>
<li><a href="#org9203d81">Music</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgef57690" class="outline-2">
<h2 id="orgef57690">News | Article</h2>
<div class="outline-text-2" id="text-orgef57690">
</div>
<div id="outline-container-orgd622d56" class="outline-3">
<h3 id="orgd622d56"><a href="https://www.thepsmiths.com/p/review-math-from-three-to-seven-by">REVIEW: Math from Three to Seven, by Alexander Zvonkin</a></h3>
<div class="outline-text-3" id="text-orgd622d56">
<blockquote>
<p>
兹冯金对孩子和成人同样有效的一个方法是，反复重复一些事情，让重复之间间隔很长时间。
</p>

<p>
这和我自己想弄明白一件事时，会认真思考一段时间，然后出去散步或洗澡的道理是一样的。
</p>

<p>
你是在劫持认知的集中模式和扩散模式之间的相互作用。
</p>

<p>
如果每次重复时，你都能从不同的角度来解决问题，那么效果会更好，这样你的潜意识就会有新的材料来咀嚼。
</p>
</blockquote>

<blockquote>
<p>
这只是为人父母的普遍经历的极端版本。
</p>

<p>
从第二个孩子出生的那一刻起，有时甚至在他们出生之前，他们就开始告诉你，你对第一个孩子的人生轨迹所产生的影响是多么微不足道。
</p>

<p>
他们之间的差异，尽管你们所做的一切几乎都是一样的，却证明了养育孩子的过程实际上是一个无能为力的过程，是一个看着新生命发现并向世界展示自己的过程。
</p>

<p>
从某种程度上说，这使得正在发生的事情更具有戏剧性&#x2013;你培养出的不是一个可以编程的白板，而是一个外星智慧生物，它将创造出一个全新的宇宙。
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org82c75a2" class="outline-3">
<h3 id="org82c75a2"><a href="https://voidzero.dev/posts/announcing-voidzero-inc">Announcing VoidZero - Next Generation Toolchain for JavaScript</a></h3>
<div class="outline-text-3" id="text-org82c75a2">
<p>
Vue 的作者尤雨溪宣布了一家新公司 VoidZero 的成立，目前已经筹集了 460 万美元的种子基金，计划打造下一代 JavaScript 工具链。
</p>

<p>
他们目前交付出来的产品有： <a href="https://oxc.rs/">Oxc</a>， <a href="https://vitest.dev/">vitest</a>， <a href="https://rolldown.rs/">Rolldown</a> 。
</p>

<p>
感兴趣还可以看看 <a href="https://viteconf.org/24/replay">ViteConf 2024 Replay</a>。
</p>
</div>
</div>

<div id="outline-container-org7dfc181" class="outline-3">
<h3 id="org7dfc181"><a href="https://papanotes.com/the-best-4-ever-spent">The best $4 ever spent</a></h3>
<div class="outline-text-3" id="text-org7dfc181">
<blockquote>
<p>
"Let's take the bus home!" my daughter said.
</p>

<p>
What a terrible idea. It would take an hour and two busses to get there, and I would most certainly get a call to come and pick up the car as soon as we'd arrive home. Terrible.
</p>

<p>
"Ok, let's do it," said I reluctantly. I know how much my daughter enjoys riding the bus. We never do it, so every time feels special.
</p>

<p>
Seeing how happy she was, it was all worth it—best $4 I've ever spent.
</p>

<p>
What's something a bit counter-intuitive you could do to delight your child this week?
</p>

<p>
P.S.: When we finally got home, it was, as anticipated, time to pick up the car. I was planning on taking a taxi but &#x2026; Sophie asked if we could ride the bus back there. No regrets!
</p>
</blockquote>

<p>
虽然乘坐公交时间长也比较麻烦，但是女儿开心，就值了。
</p>
</div>
</div>

<div id="outline-container-orga8e7e78" class="outline-3">
<h3 id="orga8e7e78"><a href="https://erikbern.com/2024/09/27/its-hard-to-write-code-for-humans.html">It's hard to write code for computers, but it's even harder to write code for humans</a></h3>
<div class="outline-text-3" id="text-orga8e7e78">
<blockquote>
<p>
Feynman famously said: Imagine how much harder physics would be if electrons had feelings.
</p>
</blockquote>

<blockquote>
<p>
Getting started shouldn't be an afterthought after you built the product. Getting started is the product!
</p>

<p>
入门不应该是在构建产品之后才考虑的问题。入门就是产品！
</p>

<p>
&#x2026;
</p>

<p>
Make it possible for users to use your product on their laptop in a couple of minutes, tops.
</p>

<p>
让用户在几分钟内就能在笔记本电脑上使用您的产品。
</p>
</blockquote>

<p>
产品要让使用者能快速上手，要是需要配置一堆东西，花半天时间，可能不少用户会放弃使用。
</p>

<blockquote>
<p>
Too many programming books and tutorials are like “let’s build a house starting from scratch, brick by brick” when what I want to “here is a functioning house, let’s learn about it by changing something and then seeing what happens”
</p>

<p>
太多的编程书籍和教程就像“让我们从头开始，一砖一瓦地建造一座房子”，而我想要的是“这里是一座正常运转的房子，让我们通过改变一些东西来了解它，然后看看会发生什么”。
</p>
</blockquote>

<blockquote>
<p>
The sad but true part of programming is, the default mode is that you're fixing an error of some sort. This means that users are going to spend the majority of the time with your tool trying to figure out what's not working.
</p>

<p>
编程的可悲但真实的一面是，默认模式是你在修复某种错误。这意味着用户在使用工具的过程中，大部分时间都在试图找出问题所在。
</p>

<ul class="org-ul">
<li>Developers getting to success faster are happy developers. They will like your tool. 更快获得成功的开发人员是快乐的开发人员。他们会喜欢你的工具。</li>
<li>Developers banging their heads against errors are sad developers. They will blame your tool. 在错误面前磕头的开发人员是可悲的开发人员。他们会指责你的工具。</li>
</ul>

<p>
Put code snippets in the exceptions. Emit helpful warnings when users are likely to do something weird. Do what you got to do to make the user succeed.
</p>

<p>
在异常中加入代码片段。在用户可能做出奇怪举动时发出有用的警告。尽你所能让用户成功。
</p>
</blockquote>

<p>
如果使用你工具的人总是碰到问题，而且也没有足够的反馈告诉用户如何解决问题，用户就会有很多挫败感，从而放弃使用这个工具。
</p>

<p>
相反，给用户足够的反馈，尽可能地帮助他们顺利地使用你的工具，用户就会快乐地继续使用你的工具。
</p>

<blockquote>
<p>
Every new conceptual thing you have to understand before using the tool makes is a new friction point. If it's 2-3 things, that's fine. But no one is going to bother learning 8 new concepts.
</p>

<p>
在使用工具之前，你必须了解的每一个新概念东西都是一个新的摩擦点。如果是 2-3 个东西，那还好。但是没有人会去费心学习 8 个新概念。
</p>
</blockquote>

<p>
避免概念过载，降低用户的心智负担。关于心智负担，可以看看 <a href="https://github.com/zakirullin/cognitive-load">Cognitive Load is what matters</a>。
</p>

<blockquote>
<p>
Somewhat related to the previous point, let's say in your framework you introduce a thing that takes some values and evalutes to a new values. What do you call it? A compute node? A valuator? A frobniscator?
</p>

<p>
No! You call it a function!
</p>

<p>
与前一点有些关联的是，假设在你的框架中引入了一个东西，它可以获取一些值并求值到一个新值。你怎么称呼它？计算节点？估值器？估值器？
</p>

<p>
不！你称之为函数！
</p>

<p>
If it walks like a duck, and it quacks like a duck, it probably is a duck.
</p>

<p>
如果它走起路来像鸭子，叫起来也像鸭子，那么它可能就是一只鸭子。
</p>

<p>
Calling it a function means you latch onto a users pre-existing mental model of what a function does. Which will save you like, 90% of the explanation of how to think about this object.
</p>

<p>
将其称为函数意味着你抓住了用户关于函数作用的已有心智模型。这将省去 90% 的解释工作，让你知道如何看待这个对象。
</p>
</blockquote>

<blockquote>
<p>
Unless defaults apply in 97%+ of the time, and unless magic applies 99% of the time, be careful about introducing it. These are not exact numbers obviously, but my point is, you need to be very very judicious.
</p>

<p>
除非在 97% 以上的情况下使用默认设置，除非在 99% 的情况下使用特殊方法，否则在引入时一定要小心谨慎。这些显然不是精确的数字，但我想说的是，你需要非常非常谨慎。
</p>
</blockquote>

<blockquote>
<p>
I sometimes think the challenge of designing for the 1st time user is similar to making a pop song. The producer will listen to the song a thousand times. But still the 999th time they hear it, they need to imagine what it sounds like to a person that hears it the first time, which seems… super hard.
</p>

<p>
我有时认为，为第一次使用的用户进行设计所面临的挑战与制作一首流行歌曲类似。制作人会听上千遍这首歌。但在第 999 次听到这首歌时，他们仍需要想象第一次听到这首歌的人听起来是什么感觉，这似乎&#x2026;&#x2026;超级困难。
</p>
</blockquote>
</div>
</div>
