post/11.org
** [[https://sohl-dickstein.github.io/2022/11/06/strong-Goodhart.html][Too much efficiency makes everything worse: overfitting and the strong version of Goodhart's law]]

#+begin_quote
Increased efficiency can sometimes, counterintuitively, lead to worse outcomes. This is true almost everywhere. We will name this phenomenon the strong version of Goodhart's law. As one example, more efficient centralized tracking of student progress by standardized testing seems like such a good idea that well-intentioned laws mandate it. However, testing also incentivizes schools to focus more on teaching students to test well, and less on teaching broadly useful skills. As a result, it can cause overall educational outcomes to become worse.

效率的提高有时会导致更糟糕的结果，这与直觉相反。

这种情况几乎无处不在。我们将这种现象命名为古德哈特定律的强力版本。

举例来说，通过标准化测试对学生的进步进行更有效的集中跟踪似乎是个好主意，以至于用心良苦的法律对此做出了规定。

然而，考试也会激励学校把更多精力放在教学生如何考好考试上，而不是教学生掌握广泛有用的技能。

因此，它可能会导致整体教育成果变得更糟。
#+end_quote

#+begin_quote
Any observed statistical regularity will tend to collapse once pressure is placed upon it for control purposes.

一旦出于控制目的对其施加压力，任何观察到的统计规律性都会趋于崩溃。

[[https://www.wikiwand.com/en/articles/Goodhart%27s_law][Goodhart's law]]
#+end_quote

** [[https://arxiv.org/abs/2008.06030][On the design of text editors]]

一篇论文，作者提出了一些编辑器的设计思路。

其中，将注释放到左边，让注释更明显的设计感觉不错。

** [[http://literateprogramming.com/index.html][Literate Programming]]

文学编程，我理解就是反转注释和代码的重要性，不再编写包含文档的代码，而是编写包含代码的文档。

#+begin_quote
I believe that the time is ripe for significantly better documentation of programs, and that we can best achieve this by considering programs to be works of literature. Hence, my title: "Literate Programming."

我认为，大幅改进程序文档的时机已经成熟，而将程序视为文学作品是实现这一目标的最佳途径。因此，我的标题是"文学编程"。

Let us change our traditional attitude to the construction of programs: Instead of imagining that our main task is to instruct a computer what to do, let us concentrate rather on explaining to human beings what we want a computer to do.

让我们改变传统的程序设计态度：与其认为我们的主要任务是指导计算机做什么，不如让我们集中精力向人类解释我们希望计算机做什么。

-- Donald Knuth. "Literate Programming (1984)" in Literate Programming. CSLI, 1992, pg. 99.
#+end_quote

** [[https://www.gov.uk/service-manual/technology/using-progressive-enhancement][Building a robust frontend using progressive enhancement]]

#+begin_quote
Progressive enhancement is a way of building websites and applications based on the idea that you should make your page work with HTML first.

Only after this can you add anything else like Cascading Style Sheets (CSS) and JavaScript.

渐进增强是一种构建网站和应用程序的方法，它基于这样一种理念，即首先要让页面使用 HTML 运行。

然后才能添加其他内容，如 CSS 和 JavaScript。
#+end_quote

文章提出了一些建议，主要是为了让页面稳健，不容易出错。

#+begin_quote
Progressive enhancement means building the interface of a website or application in layers. If the user’s browser only supports HTML they get content and forms. If the user’s browser also supports styles and fonts the application looks better. If it can run JavaScript the user gains extra interactions. Only the core HTML though is required in order to meet users’ basic needs.

渐进增强意味着分层构建网站或应用程序的界面。

如果用户的浏览器只支持HTML，他们就会得到内容和表单。

如果用户的浏览器还支持样式和字体，应用程序就会看起来更好。

如果它能运行 JavaScript ，用户就能获得额外的交互。

满足用户的基本需求只需要核心的 HTML。

-- [[https://technology.blog.gov.uk/2016/09/19/why-we-use-progressive-enhancement-to-build-gov-uk/][Why we use progressive enhancement to build GOV.UK]]
#+end_quote

** [[https://jimmyhmiller.github.io/raised][Being Raised by the Internet]]

#+begin_quote
They may not have set out to share out of altrusitic motivations. I am certain they never intended to inspire a 12 year-old kid to find a better life. But it doesn't matter their motivations. They changed my life. All I can say is thank you. Thank you for sharing your work. Thank you for your blogs posts, your tutorials, thank you for your slashdot comments, for your posts on digg. No matter how small your contribution, it mattered to me. You changed my life. Thank you.

他们也许并不是出于利他主义的动机才开始分享的。

我确信他们从未想过要激励一个 12 岁的孩子去寻找更美好的生活。

但他们的动机并不重要。他们改变了我的生活。我只能说谢谢你们。

感谢你们分享自己的作品。感谢你们的博客文章、教程，感谢你们在 slashdot 上的评论，感谢你们在 digg 上的文章。

无论你的贡献有多小，对我来说都很重要。你们改变了我的生活。谢谢你们。

#+end_quote
** [[https://eslint.org/blog/2024/10/eslint-json-markdown-support/][ESLint now officially supports linting of JSON and Markdown]]

Eslint 现在可以 lint JSON 和 Markdown 了，真不错。


* Tutorial

** [[https://www.linuxfromscratch.org/index.html][Linux From Scratch]]

#+begin_quote
Linux From Scratch (LFS) is a project that provides you with step-by-step instructions for building your own custom Linux system, entirely from source code.
#+end_quote

** [[https://shipit.dev/posts/from-utterances-to-giscus.html][Moving from utterances to giscus]]

前阵子将评论系统从 utterances 换成了 giscus，参考了这篇文章。

原来 utterances 生成的 issues 可以批量转换成 giscus 的 discussions。（参考 [[https://docs.github.com/en/discussions/managing-discussions-for-your-community/managing-discussions#converting-issues-based-on-labels][Converting issues based on labels]]）

** [YouTube][[https://www.youtube.com/watch?v=JUS6EPMbk0U&ab_channel=devongovett][Bundling Past, Present, and Future]]

关于 bundle 工具的过去、现在和未来。

** [[https://janhesters.com/blog/unleash-javascripts-potential-with-functional-programming][Unleash JavaScript's Potential with Functional Programming]]

JS 函数式编程入门，非常多的概念，准备好一杯咖啡再慢慢看吧 :P


* Code

** [[https://frontendmasters.com/blog/whats-the-difference-between-htmls-dialog-element-and-popovers/][What’s the Difference Between HTML’s Dialog Element and Popovers?]]

[[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/dialog][<dialog>]] 和 [[https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/popover][popover]] 的详尽比较。

** [[https://www.smashingmagazine.com/2024/09/how-manage-dangerous-actions-user-interfaces/][How To Manage Dangerous Actions In User Interfaces]]

对于页面上的“危险操作”，如何设计交互。

#+begin_quote
Therefore, a dangerous action does not necessarily mean deleting something.

Some examples may include the following:

- Sending an email
- Placing an order
- Publishing a post
- Making a bank transaction
- Granting or revoking permissions.
- ...
#+end_quote

一种常见的交互是 Modal，在使用 Modal 的时候最好详细描述操作的影响，而不是仅仅一句“你确定吗”，让人摸不着头脑。

有时只是让用户确认还不够，可能还需要用户输入一些内容才允许完成操作，例如 GitHub 删除 Repo 时的交互。

此外文中还提到了其他方法：

- Danger Zone
- Inline Guards
- Two-factor Authorization Confirmation
- Second-person Confirmation (类似 Pull request，需要另一个人的审批)
- ...

最后作者还补充了一个交互更好的例子。

