publish/11.html

<div id="outline-container-orgced3854" class="outline-3">
<h3 id="orgced3854"><a href="https://sohl-dickstein.github.io/2022/11/06/strong-Goodhart.html">Too much efficiency makes everything worse: overfitting and the strong version of Goodhart's law</a></h3>
<div class="outline-text-3" id="text-orgced3854">
<blockquote>
<p>
Increased efficiency can sometimes, counterintuitively, lead to worse outcomes. This is true almost everywhere. We will name this phenomenon the strong version of Goodhart's law. As one example, more efficient centralized tracking of student progress by standardized testing seems like such a good idea that well-intentioned laws mandate it. However, testing also incentivizes schools to focus more on teaching students to test well, and less on teaching broadly useful skills. As a result, it can cause overall educational outcomes to become worse.
</p>

<p>
效率的提高有时会导致更糟糕的结果，这与直觉相反。
</p>

<p>
这种情况几乎无处不在。我们将这种现象命名为古德哈特定律的强力版本。
</p>

<p>
举例来说，通过标准化测试对学生的进步进行更有效的集中跟踪似乎是个好主意，以至于用心良苦的法律对此做出了规定。
</p>

<p>
然而，考试也会激励学校把更多精力放在教学生如何考好考试上，而不是教学生掌握广泛有用的技能。
</p>

<p>
因此，它可能会导致整体教育成果变得更糟。
</p>
</blockquote>

<blockquote>
<p>
Any observed statistical regularity will tend to collapse once pressure is placed upon it for control purposes.
</p>

<p>
一旦出于控制目的对其施加压力，任何观察到的统计规律性都会趋于崩溃。
</p>

<p>
<a href="https://www.wikiwand.com/en/articles/Goodhart%27s_law">Goodhart's law</a>
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgea67d6f" class="outline-3">
<h3 id="orgea67d6f"><a href="https://arxiv.org/abs/2008.06030">On the design of text editors</a></h3>
<div class="outline-text-3" id="text-orgea67d6f">
<p>
一篇论文，作者提出了一些编辑器的设计思路。
</p>

<p>
其中，将注释放到左边，让注释更明显的设计感觉不错。
</p>
</div>
</div>

<div id="outline-container-org29c0669" class="outline-3">
<h3 id="org29c0669"><a href="http://literateprogramming.com/index.html">Literate Programming</a></h3>
<div class="outline-text-3" id="text-org29c0669">
<p>
文学编程，我理解就是反转注释和代码的重要性，不再编写包含文档的代码，而是编写包含代码的文档。
</p>

<blockquote>
<p>
I believe that the time is ripe for significantly better documentation of programs, and that we can best achieve this by considering programs to be works of literature. Hence, my title: "Literate Programming."
</p>

<p>
我认为，大幅改进程序文档的时机已经成熟，而将程序视为文学作品是实现这一目标的最佳途径。因此，我的标题是"文学编程"。
</p>

<p>
Let us change our traditional attitude to the construction of programs: Instead of imagining that our main task is to instruct a computer what to do, let us concentrate rather on explaining to human beings what we want a computer to do.
</p>

<p>
让我们改变传统的程序设计态度：与其认为我们的主要任务是指导计算机做什么，不如让我们集中精力向人类解释我们希望计算机做什么。
</p>

<p>
&#x2013; Donald Knuth. "Literate Programming (1984)" in Literate Programming. CSLI, 1992, pg. 99.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org2cbc4b7" class="outline-3">
<h3 id="org2cbc4b7"><a href="https://www.gov.uk/service-manual/technology/using-progressive-enhancement">Building a robust frontend using progressive enhancement</a></h3>
<div class="outline-text-3" id="text-org2cbc4b7">
<blockquote>
<p>
Progressive enhancement is a way of building websites and applications based on the idea that you should make your page work with HTML first.
</p>

<p>
Only after this can you add anything else like Cascading Style Sheets (CSS) and JavaScript.
</p>

<p>
渐进增强是一种构建网站和应用程序的方法，它基于这样一种理念，即首先要让页面使用 HTML 运行。
</p>

<p>
然后才能添加其他内容，如 CSS 和 JavaScript。
</p>
</blockquote>

<p>
文章提出了一些建议，主要是为了让页面稳健，不容易出错。
</p>

<blockquote>
<p>
Progressive enhancement means building the interface of a website or application in layers. If the user’s browser only supports HTML they get content and forms. If the user’s browser also supports styles and fonts the application looks better. If it can run JavaScript the user gains extra interactions. Only the core HTML though is required in order to meet users’ basic needs.
</p>

<p>
渐进增强意味着分层构建网站或应用程序的界面。
</p>

<p>
如果用户的浏览器只支持HTML，他们就会得到内容和表单。
</p>

<p>
如果用户的浏览器还支持样式和字体，应用程序就会看起来更好。
</p>

<p>
如果它能运行 JavaScript ，用户就能获得额外的交互。
</p>

<p>
满足用户的基本需求只需要核心的 HTML。
</p>

<p>
&#x2013; <a href="https://technology.blog.gov.uk/2016/09/19/why-we-use-progressive-enhancement-to-build-gov-uk/">Why we use progressive enhancement to build GOV.UK</a>
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orge7e4a1a" class="outline-3">
<h3 id="orge7e4a1a"><a href="https://jimmyhmiller.github.io/raised">Being Raised by the Internet</a></h3>
<div class="outline-text-3" id="text-orge7e4a1a">
<blockquote>
<p>
They may not have set out to share out of altrusitic motivations. I am certain they never intended to inspire a 12 year-old kid to find a better life. But it doesn't matter their motivations. They changed my life. All I can say is thank you. Thank you for sharing your work. Thank you for your blogs posts, your tutorials, thank you for your slashdot comments, for your posts on digg. No matter how small your contribution, it mattered to me. You changed my life. Thank you.
</p>

<p>
他们也许并不是出于利他主义的动机才开始分享的。
</p>

<p>
我确信他们从未想过要激励一个 12 岁的孩子去寻找更美好的生活。
</p>

<p>
但他们的动机并不重要。他们改变了我的生活。我只能说谢谢你们。
</p>

<p>
感谢你们分享自己的作品。感谢你们的博客文章、教程，感谢你们在 slashdot 上的评论，感谢你们在 digg 上的文章。
</p>

<p>
无论你的贡献有多小，对我来说都很重要。你们改变了我的生活。谢谢你们。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org9a1dcfd" class="outline-3">
<h3 id="org9a1dcfd"><a href="https://eslint.org/blog/2024/10/eslint-json-markdown-support/">ESLint now officially supports linting of JSON and Markdown</a></h3>
<div class="outline-text-3" id="text-org9a1dcfd">
<p>
Eslint 现在可以 lint JSON 和 Markdown 了，真不错。
</p>
</div>
</div>
</div>


<div id="outline-container-org23ecab4" class="outline-2">
<h2 id="org23ecab4">Tutorial</h2>
<div class="outline-text-2" id="text-org23ecab4">
</div>
<div id="outline-container-org42d35a0" class="outline-3">
<h3 id="org42d35a0"><a href="https://www.linuxfromscratch.org/index.html">Linux From Scratch</a></h3>
<div class="outline-text-3" id="text-org42d35a0">
<blockquote>
<p>
Linux From Scratch (LFS) is a project that provides you with step-by-step instructions for building your own custom Linux system, entirely from source code.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orge19aa81" class="outline-3">
<h3 id="orge19aa81"><a href="https://shipit.dev/posts/from-utterances-to-giscus.html">Moving from utterances to giscus</a></h3>
<div class="outline-text-3" id="text-orge19aa81">
<p>
前阵子将评论系统从 utterances 换成了 giscus，参考了这篇文章。
</p>

<p>
原来 utterances 生成的 issues 可以批量转换成 giscus 的 discussions。（参考 <a href="https://docs.github.com/en/discussions/managing-discussions-for-your-community/managing-discussions#converting-issues-based-on-labels">Converting issues based on labels</a>）
</p>
</div>
</div>

<div id="outline-container-org03c0adc" class="outline-3">
<h3 id="org03c0adc">[YouTube]<a href="https://www.youtube.com/watch?v=JUS6EPMbk0U&amp;ab_channel=devongovett">Bundling Past, Present, and Future</a></h3>
<div class="outline-text-3" id="text-org03c0adc">
<p>
关于 bundle 工具的过去、现在和未来。
</p>
</div>
</div>

<div id="outline-container-org8513598" class="outline-3">
<h3 id="org8513598"><a href="https://janhesters.com/blog/unleash-javascripts-potential-with-functional-programming">Unleash JavaScript's Potential with Functional Programming</a></h3>
<div class="outline-text-3" id="text-org8513598">
<p>
JS 函数式编程入门，非常多的概念，准备好一杯咖啡再慢慢看吧 :P
</p>
</div>
</div>
</div>


<div id="outline-container-org0016c43" class="outline-2">
<h2 id="org0016c43">Code</h2>
<div class="outline-text-2" id="text-org0016c43">
</div>
<div id="outline-container-orgb8f6979" class="outline-3">
<h3 id="orgb8f6979"><a href="https://frontendmasters.com/blog/whats-the-difference-between-htmls-dialog-element-and-popovers/">What’s the Difference Between HTML’s Dialog Element and Popovers?</a></h3>
<div class="outline-text-3" id="text-orgb8f6979">
<p>
<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/dialog">&lt;dialog&gt;</a> 和 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/popover">popover</a> 的详尽比较。
</p>
</div>
</div>

<div id="outline-container-org7ac19d7" class="outline-3">
<h3 id="org7ac19d7"><a href="https://www.smashingmagazine.com/2024/09/how-manage-dangerous-actions-user-interfaces/">How To Manage Dangerous Actions In User Interfaces</a></h3>
<div class="outline-text-3" id="text-org7ac19d7">
<p>
对于页面上的“危险操作”，如何设计交互。
</p>

<blockquote>
<p>
Therefore, a dangerous action does not necessarily mean deleting something.
</p>

<p>
Some examples may include the following:
</p>

<ul class="org-ul">
<li>Sending an email</li>
<li>Placing an order</li>
<li>Publishing a post</li>
<li>Making a bank transaction</li>
<li>Granting or revoking permissions.</li>
<li>&#x2026;</li>
</ul>
</blockquote>

<p>
一种常见的交互是 Modal，在使用 Modal 的时候最好详细描述操作的影响，而不是仅仅一句“你确定吗”，让人摸不着头脑。
</p>

<p>
有时只是让用户确认还不够，可能还需要用户输入一些内容才允许完成操作，例如 GitHub 删除 Repo 时的交互。
</p>

<p>
此外文中还提到了其他方法：
</p>

<ul class="org-ul">
<li>Danger Zone</li>
<li>Inline Guards</li>
<li>Two-factor Authorization Confirmation</li>
<li>Second-person Confirmation (类似 Pull request，需要另一个人的审批)</li>
<li>&#x2026;</li>
</ul>

<p>
最后作者还补充了一个交互更好的例子。
</p>
</div>
</div>
